Repository: AMirSaLaRG/portfolio
Catalog: first_portfolio/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Home
fa: صفحه اصلی

source: About Me
fa: درباره من

source: Hi! I'm a former <strong>Mechanical Engineer</strong> with 3 years of experience in industrial and power plant projects. During my time in the field, I worked as a <strong>Technical Officer</strong>, interpreting engineering drawings, managing on-site workers, and ensuring project execution aligned with specifications. This role honed my problem-solving skills and attention to detail—qualities I now apply to programming.
fa: سلام! من یک <strong>مهندس مکانیک</strong> سابق با 3 سال سابقه در پروژه‌های صنعتی و نیروگاهی هستم. در طول فعالیتم در این زمینه، به عنوان <strong>افسر فنی</strong> مشغول بودم که شامل تفسیر نقشه‌های مهندسی، مدیریت کارگران در محل اجرا و اطمینان از انطباق اجرای پروژه با مشخصات فنی می‌شد. این نقش مهارت‌های حل مسئله و توجه به جزئیات را در من تقویت کرد - ویژگی‌هایی که اکنون در برنامه‌نویسی به کار می‌برم.

source: In 2023, I decided to pivot my career toward <strong>software development</strong>, focusing on <strong>Python, web development (HTML/CSS/JavaScript), and data science</strong>, with a long-term goal of transitioning into <strong>AI/ML</strong>. Over the past year, I've immersed myself in learning through project-based courses (Udemy, YouTube) and official documentation (like Django's). I'm now building a portfolio of projects to showcase my skills and actively seeking <strong>freelance or entry-level roles</strong> in programming or web development.
fa: در سال 2023، تصمیم گرفتم مسیر شغلی خود را به سمت <strong>توسعه نرم‌افزار</strong> تغییر دهم، با تمرکز بر <strong>پایتون، توسعه وب (HTML/CSS/JavaScript) و علم داده</strong>، با هدف بلندمدت ورود به حوزه <strong>هوش مصنوعی/یادگیری ماشین</strong>. در طول سال گذشته، خود را غرق یادگیری از طریق دوره‌های پروژه‌محور (Udemy, YouTube) و مستندات رسمی (مانند مستندات جنگو) کرده‌ام. اکنون در حال ساخت مجموعه‌ای از پروژه‌ها برای نمایش مهارت‌هایم هستم و فعالانه به دنبال <strong>موقعیت‌های فریلنس یا سطح ابتدایی</strong> در برنامه‌نویسی یا توسعه وب می‌گردم.

source: What drives me? A genuine passion for coding—I love turning ideas into functional solutions—and the rapid growth potential of this field. Born in <strong>April 1992</strong>, I bring a mature, disciplined mindset from my engineering background, combined with the agility to adapt to new technologies.
fa: انگیزه من چیست؟ علاقه‌ای اصیل به کدنویسی - عاشق تبدیل ایده‌ها به راه‌حل‌های عملی هستم - و پتانسیل رشد سریع این حوزه. متولد <strong>آوریل 1992</strong>، با ذهنی بالغ و منظم از پیشینه مهندسی خود، همراه با انعطاف‌پذیری برای سازگاری با فناوری‌های جدید وارد این حوزه شده‌ام.

source: Let's connect if you're looking for a <strong>dedicated junior developer</strong> or have advice for my journey!
fa: بیایید در ارتباط باشیم اگر به دنبال یک <strong>توسعه‌دهنده جونیور متعهد</strong> هستید یا راهنمایی برای سفر من دارید!

source: Skills
fa: مهارت‌ها

source: Courses
fa: دوره ها

source: Get in touch
fa: در تماس باشیم

source: Send Message
fa: ارسال پیام

source: projects
fa: پروژه ها

source: Contact
fa: تماس

source: Amirsalar Ghaffari
fa: امیرسالار غفاری

source: Programming and Web development
fa: برنامه نویسی و طراحی سایت

source: About me
fa: درباره من

source: Contact me
fa: تماس

source: Projects
fa: پروژه ها

source: Page
fa: صفحه

source: Read More
fa: ادامه مطلب

source: Interested in collaborating or have a project in mind?
fa: علاقه مند به همکاری یا انجام پروژه مشترک هستید؟

source: Let’s connect! Whether it’s Python automation, web development,
fa: با هم در تماس باشیم در ارتباط با برنامه نویسی پابتون و یا طراحی سایتو

source: Contact Me
fa: تماس با من
